app/views/users/show.html.erb


            <% @user.nfts.order([:fights_won]).reverse.each do |nft| %>
---
SELECT "nfts".* FROM "nfts" WHERE "nfts"."user_id" = $1 ORDER BY "nfts"."fights_won" ASC  [["user_id", 50]]