app/views/users/show.html.erb

                        <h1>Join Tournament</h1>
                        <h3><%= @tournament.nfts.count %> / 4</h3>
---
SELECT "nfts".* FROM "nfts" WHERE "nfts"."user_id" = $1  [["user_id", 50]]


                        <% if @tournament.nfts.where(user_id:@current_user.id).count >= 1 %>
---
SELECT "nfts".* FROM "nfts" WHERE "nfts"."user_id" = $1  [["user_id", 50]]

                            <% if @tournament.nfts.where(user_id:@current_user.id).count == 1 %>
                                <h3>You have <%= @tournament.nfts.where(user_id:@current_user.id).count %> fighter registered.</h3>
---
SELECT "nfts".* FROM "nfts" WHERE "nfts"."user_id" = $1  [["user_id", 50]]