app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
    def fetch_user

        #check if user id in session hash is set and see if it is a user in our user table
        # if it is, get row object and save in to @current_user which every merthod or any action can access
        # if ID is not a current ID consider it invalid and delete session (preventing weird errors for stale or expired user ids when re-seeding)

        if session[:user_id].present?
            @current_user = User.find_by id:session[:user_id]