app/controllers/nfts_controller.rb

SELECT  "nfts".* FROM "nfts" ORDER BY "nfts"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def rankings
    @nfts = Nft.all

SELECT  "nfts".* FROM "nfts" WHERE "nfts"."id" = $1 LIMIT $2  [["id", 694], ["LIMIT", 1]]
SELECT "nfts".* FROM "nfts" INNER JOIN "users" ON "users"."id" = "nfts"."user_id" WHERE "users"."eth_in_wallet" BETWEEN $1 AND $2  [["eth_in_wallet", 0.2], ["eth_in_wallet", 1000000.0]]
---
  def fight
    @nft = Nft.find params[:id]

    eth_range = 0.2..1000000
    opponent_list = Nft.joins(:user).where(users: {eth_in_wallet: eth_range})
    #had to add this in to only keep others from foghting
    opponent_list_final = opponent_list.where.not(user_id: @current_user.id)

INSERT INTO "nfts" ("user_id", "mint_season", "mint_bracket", "eye_colour", "hair_style", "hair_colour", "skin_colour", "shorts", "facial_expression", "body_type", "handwear", "background_colour", "tattoos", "total_fights", "best_position", "amount_won", "created_at", "updated_at", "image", "fights_won", "average_position") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
---
  def create
    @nft = Nft.new nft_params()
    @nft.user_id = @current_user.id
    @nft.save

SELECT "nfts".* FROM "nfts"
---
  def index
    @nfts = Nft.all

SELECT  "nfts".* FROM "nfts" WHERE "nfts"."id" = $1 LIMIT $2  [["id", 694], ["LIMIT", 1]]
---
  def show
    @nft = Nft.find params[:id]

SELECT  "nfts".* FROM "nfts" WHERE "nfts"."id" = $1 LIMIT $2  [["id", 308], ["LIMIT", 1]]
---
  def edit
    @nft = Nft.find params[:id]

SELECT  "nfts".* FROM "nfts" WHERE "nfts"."id" = $1 LIMIT $2  [["id", 695], ["LIMIT", 1]]
UPDATE "users" SET "eth_in_wallet" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["eth_in_wallet", 21.2], ["updated_at", "2022-02-02 00:26:17.525578"], ["id", 73]]
UPDATE "nfts" SET "user_id" = $1, "updated_at" = $2 WHERE "nfts"."id" = $3  [["user_id", 73], ["updated_at", "2022-02-02 00:26:17.531479"], ["id", 695]]
---
  def update

    @nft = Nft.find params[:id]

    # TODO: Ask Luke where @current_nft is
    # if @nft.id != @current_nft.id
    #   redirect_to login_path
    #   return
    # end
    if @current_user.eth_in_wallet >= 0.8

      eth_to_take_from = @current_user.eth_in_wallet.to_f
      new_eth_total = (eth_to_take_from.to_f - 0.8)

      @current_user.update eth_in_wallet: new_eth_total
      @nft.update nft_params

SELECT  "nfts".* FROM "nfts" WHERE "nfts"."user_id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def mint
    @nft = Nft.find_by user_id: nil