app/controllers/session_controller.rb

  def create
    # find the email address entered is actually in the DB
    #use find_by as it returns the object
    user = User.find_by email: params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "lukearthur@gmail.com"], ["LIMIT", 1]]