app/controllers/users_controller.rb

  def create

    @user = User.new user_params

    if params[:user][:profile_image].present?
        # Forward the uploaded image on to Cloudinary (using the gem):
        response = Cloudinary::Uploader.upload params[:user][:profile_image]
        p response  # so we can see what the response looks like
        @user.profile_image = response['public_id']
    end  # upload check

    @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest", "eth_in_wallet", "profile_image") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]

  def edit
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]

  def update

    @user = User.find params[:id]


    if params[:user][:profile_image].present?
        # Forward the uploaded image on to Cloudinary (using the gem):
        response = Cloudinary::Uploader.upload params[:user][:profile_image]
        p response  # so we can see what the response looks like
        @user.profile_image = response['public_id']
    end  # upload check

    if @user.id != @current_user.id
      redirect_to login_path
      return
    end

    eth_to_add = user_params[:eth_in_wallet].to_f
    new_eth_total = (eth_to_add + @user.eth_in_wallet.to_f)

    if @user.update user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]
UPDATE "users" SET "profile_image" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["profile_image", "buelhdmpxxxi1bmqueyk"], ["password_digest", "$2a$12$zWUeO6da2B3gKg8ZcglgAuSXKV5e.nEC3OKo72wtZHENc7uIIP7QK"], ["updated_at", "2022-02-02 01:33:11.037582"], ["id", 78]]

  def addfunds
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]