app/controllers/users_controller.rb

  def update

    @user = User.find params[:id]

    if @user.id != @current_user.id
      redirect_to login_path
      return
    end

    eth_to_add = user_params[:eth_in_wallet].to_f
    new_eth_total = (eth_to_add + @user.eth_in_wallet.to_f)

    if @user.update user_params
      @user.update eth_in_wallet: new_eth_total
---
UPDATE "users" SET "eth_in_wallet" = $1, "username" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["eth_in_wallet", 0.0], ["username", "thelorddoyle2"], ["password_digest", "$2a$12$JfISNrvZ5aJzQLsNjjCaFu/pkvHiDab7.HXcMF.NzsTbzlm.nTRya"], ["updated_at", "2022-02-01 00:37:59.608941"], ["id", 50]]
UPDATE "users" SET "eth_in_wallet" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["eth_in_wallet", 1.0], ["updated_at", "2022-01-31 23:47:30.054346"], ["id", 50]]